src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ЛогинSkype</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопРеквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Позвонить(Команда)
	ЗапуститьПриложение("skype:"+Объект.ЛогинSkype+"?call");
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыНаФорму(ВыборкаДопРеквизитов)
	
	Пока ВыборкаДопРеквизитов.Следующий() Цикл
		ДобавляемыеРеквизиты = Новый Массив; 
		Если ВыборкаДопРеквизитов.ТипДанных = "Число" тогда
			КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
		    ОписаниеТипов = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
		ИначеЕсли ВыборкаДопРеквизитов.ТипДанных = "Строка" тогда
			КвалификаторыСтроки = Новый КвалификаторыСтроки(50);
    		ОписаниеТипов = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
		Иначе	
			ОписаниеТипов = Новый ОписаниеТипов(ВыборкаДопРеквизитов.ТипДанных);
		КонецЕсли;
		
	    Реквизит = Новый РеквизитФормы(ВыборкаДопРеквизитов.Реквизит, ОписаниеТипов); 
	    ДобавляемыеРеквизиты.Добавить(Реквизит); 
	    ИзменитьРеквизиты(ДобавляемыеРеквизиты); 		
	    Элемент = ЭтаФорма.Элементы.Добавить(ВыборкаДопРеквизитов.Реквизит, Тип("ПолеФормы"), ЭтаФорма.Элементы.ДопРеквизиты); 
	    Элемент.Вид = ВидПоляФормы.ПолеВвода; 
	    Элемент.ПутьКДанным = ВыборкаДопРеквизитов.Реквизит; 
	    Элемент.РастягиватьПоГоризонтали = Истина;
	    Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		Элемент.Заголовок = СтрЗаменить(Элемент.Имя,"ДопРеквизит_","");
	    ЭтаФорма.Элементы[ВыборкаДопРеквизитов.Реквизит].КнопкаОчистки = Истина;
	    ЭтаФорма.Элементы[ВыборкаДопРеквизитов.Реквизит].КнопкаВыбора  = Истина;
		
		НайденнаяСтрока = Неопределено;
		МассивСтрок = Объект.ДопРеквизиты.НайтиСтроки(Новый Структура("Реквизит", ВыборкаДопРеквизитов.Реквизит));
		Если МассивСтрок.Количество() > 0 Тогда
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если Не НайденнаяСтрока = Неопределено Тогда
			ЭтаФорма[ВыборкаДопРеквизитов.Реквизит] = НайденнаяСтрока.Значение;	
		КонецЕсли;
				
	    Элемент.УстановитьДействие("ПриИзменении","ИзменениеДопРеквизитов");
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДопРеквизитов()
	
	МассивСтрок = Объект.ДопРеквизиты.НайтиСтроки(Новый Структура("Реквизит", ЭтаФорма.ТекущийЭлемент.Имя));
	Если МассивСтрок.Количество() > 0 Тогда
	      НайденнаяСтрока = МассивСтрок[0];
	КонецЕсли;
		
	Если НайденнаяСтрока = Неопределено Тогда
		НоваяСтрока = Объект.ДопРеквизиты.Добавить();
		НоваяСтрока.Реквизит = ЭтаФорма.ТекущийЭлемент.Имя;
		НоваяСтрока.Значение = ЭтаФорма[ЭтаФорма.ТекущийЭлемент.Имя];
	Иначе
		НайденнаяСтрока.Значение = ЭтаФорма[ЭтаФорма.ТекущийЭлемент.Имя];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыборкаДопРеквизитов = ПроцедурыОбщегоНазначения.обПолучитьСписокДопРеквизитов(Метаданные.Справочники.Контрагенты.Представление());
	ДобавитьРеквизитыНаФорму(ВыборкаДопРеквизитов);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	СМС(Объект.Телефон,ТекстСМС,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СМС(Кому, Текст, ПослатьИнтерактивно)
	#Если МобильноеПриложениеКлиент Тогда
		СМС = Новый SMSСообщение();
		СМС.Текст = Текст;
		СМС.Получатели.Добавить(СокрЛП(Кому));
		СредстваТелефонии.ПослатьSMS(СМС, ПослатьИнтерактивно);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикПолученияСообщений()
	#Если МобильноеПриложениеКлиент Тогда
		ПолучательСообщений = Новый ОписаниеОповещения("ПолучениеСообщения", ЭтотОбъект);
		СредстваТелефонии.ПодключитьОбработчикSMSСообщений(ПолучательСообщений);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСообщения(Сообщение, ДополнительныеПараметры) Экспорт
  	Сообщить(Сообщение.Отправитель + " – " + Сообщение.Текст);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикПолученияСообщений();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСМС(Команда)
	ЧтениеСМС();
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеСМС()
	#Если МобильноеПриложениеКлиент Тогда
		МассивСМС = СредстваТелефонии.ПолучитьЖурналSMS().НайтиЗаписи();
		ТекстСМС = "";
		Для Каждого ТекСтрока из МассивСМС Цикл
			ТекстСМС = ТекстСМС + Символы.ПС+ТекСтрока.Текст+" "+ТекСтрока.ДатаПолучения;
			ТекстСМС = ТекстСМС + Символы.ПС+"-----------------------";
		КонецЦикла;
	#КонецЕсли
КонецПроцедуры
